; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=94, out_folder=htg/blocksworld/training, instance_id=74, seed=2098, goal_proportion=0.1

(define (problem blocksworld-74)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 - object)
 (:init 
    (arm-empty)
    (clear b28)
    (on b28 b59)
    (on b59 b71)
    (on-table b71)
    (clear b93)
    (on b93 b54)
    (on b54 b51)
    (on b51 b81)
    (on-table b81)
    (clear b39)
    (on b39 b21)
    (on b21 b84)
    (on b84 b64)
    (on-table b64)
    (clear b12)
    (on b12 b44)
    (on b44 b35)
    (on b35 b79)
    (on b79 b60)
    (on b60 b2)
    (on b2 b94)
    (on b94 b82)
    (on b82 b57)
    (on b57 b55)
    (on b55 b52)
    (on b52 b68)
    (on b68 b83)
    (on b83 b10)
    (on b10 b8)
    (on b8 b41)
    (on b41 b3)
    (on b3 b34)
    (on b34 b85)
    (on b85 b24)
    (on b24 b53)
    (on b53 b56)
    (on b56 b46)
    (on b46 b66)
    (on-table b66)
    (clear b20)
    (on b20 b4)
    (on b4 b33)
    (on b33 b69)
    (on b69 b65)
    (on b65 b73)
    (on b73 b42)
    (on b42 b88)
    (on b88 b58)
    (on b58 b87)
    (on b87 b74)
    (on b74 b38)
    (on b38 b92)
    (on b92 b86)
    (on b86 b67)
    (on b67 b16)
    (on b16 b26)
    (on b26 b43)
    (on b43 b36)
    (on b36 b11)
    (on b11 b80)
    (on b80 b14)
    (on b14 b61)
    (on b61 b23)
    (on-table b23)
    (clear b19)
    (on b19 b62)
    (on b62 b18)
    (on b18 b1)
    (on b1 b7)
    (on b7 b29)
    (on b29 b30)
    (on b30 b37)
    (on b37 b9)
    (on b9 b40)
    (on b40 b47)
    (on b47 b48)
    (on b48 b75)
    (on b75 b6)
    (on b6 b22)
    (on b22 b63)
    (on b63 b13)
    (on b13 b49)
    (on b49 b17)
    (on b17 b91)
    (on b91 b25)
    (on b25 b89)
    (on b89 b77)
    (on b77 b5)
    (on b5 b45)
    (on-table b45)
    (clear b27)
    (on b27 b70)
    (on b70 b50)
    (on b50 b32)
    (on b32 b90)
    (on b90 b15)
    (on b15 b72)
    (on b72 b76)
    (on-table b76)
    (clear b78)
    (on b78 b31)
    (on-table b31))
 (:goal  (and 
    (clear b9)
    (on b9 b8)
    (on b8 b1)
    (on b1 b4)
    (on b4 b6)
    (on b6 b7)
    (on b7 b2)
    (on b2 b5)
    (on-table b5)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b12 b44)
   deleted: (on b12 b44) (clear b12) (arm-empty)
   added: (holding b12) (clear b44)
   goals met: 0 of 11
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 11
3. (unstack b20 b4)
   deleted: (on b20 b4) (clear b20) (arm-empty)
   added: (holding b20) (clear b4)
   goals met: 0 of 11
4. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 11
5. (unstack b19 b62)
   deleted: (on b19 b62) (clear b19) (arm-empty)
   added: (holding b19) (clear b62)
   goals met: 0 of 11
6. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 11
7. (unstack b62 b18)
   deleted: (on b62 b18) (clear b62) (arm-empty)
   added: (holding b62) (clear b18)
   goals met: 0 of 11
8. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 0 of 11
9. (unstack b18 b1)
   deleted: (on b18 b1) (clear b18) (arm-empty)
   added: (holding b18) (clear b1)
   goals met: 0 of 11
10. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 11
11. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 0 of 11
12. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 1 of 11
13. (unstack b44 b35)
   deleted: (on b44 b35) (clear b44) (arm-empty)
   added: (holding b44) (clear b35)
   goals met: 1 of 11
14. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 1 of 11
15. (unstack b35 b79)
   deleted: (on b35 b79) (clear b35) (arm-empty)
   added: (holding b35) (clear b79)
   goals met: 1 of 11
16. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 1 of 11
17. (unstack b79 b60)
   deleted: (on b79 b60) (clear b79) (arm-empty)
   added: (holding b79) (clear b60)
   goals met: 1 of 11
18. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 1 of 11
19. (unstack b60 b2)
   deleted: (on b60 b2) (clear b60) (arm-empty)
   added: (holding b60) (clear b2)
   goals met: 1 of 11
20. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 1 of 11
21. (unstack b7 b29)
   deleted: (on b7 b29) (clear b7) (arm-empty)
   added: (holding b7) (clear b29)
   goals met: 1 of 11
22. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 2 of 11
23. (unstack b29 b30)
   deleted: (on b29 b30) (clear b29) (arm-empty)
   added: (holding b29) (clear b30)
   goals met: 2 of 11
24. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 2 of 11
25. (unstack b30 b37)
   deleted: (on b30 b37) (clear b30) (arm-empty)
   added: (holding b30) (clear b37)
   goals met: 2 of 11
26. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 2 of 11
27. (unstack b37 b9)
   deleted: (on b37 b9) (clear b37) (arm-empty)
   added: (holding b37) (clear b9)
   goals met: 3 of 11
28. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 3 of 11
29. (unstack b9 b40)
   deleted: (on b9 b40) (clear b9) (arm-empty)
   added: (holding b9) (clear b40)
   goals met: 2 of 11
30. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 11
31. (unstack b40 b47)
   deleted: (on b40 b47) (clear b40) (arm-empty)
   added: (holding b40) (clear b47)
   goals met: 3 of 11
32. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 11
33. (unstack b47 b48)
   deleted: (on b47 b48) (clear b47) (arm-empty)
   added: (holding b47) (clear b48)
   goals met: 3 of 11
34. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 3 of 11
35. (unstack b48 b75)
   deleted: (on b48 b75) (clear b48) (arm-empty)
   added: (holding b48) (clear b75)
   goals met: 3 of 11
36. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 3 of 11
37. (unstack b75 b6)
   deleted: (on b75 b6) (clear b75) (arm-empty)
   added: (holding b75) (clear b6)
   goals met: 3 of 11
38. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 3 of 11
39. (unstack b6 b22)
   deleted: (on b6 b22) (clear b6) (arm-empty)
   added: (holding b6) (clear b22)
   goals met: 3 of 11
40. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 4 of 11
41. (unstack b22 b63)
   deleted: (on b22 b63) (clear b22) (arm-empty)
   added: (holding b22) (clear b63)
   goals met: 4 of 11
42. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 11
43. (unstack b63 b13)
   deleted: (on b63 b13) (clear b63) (arm-empty)
   added: (holding b63) (clear b13)
   goals met: 4 of 11
44. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 4 of 11
45. (unstack b13 b49)
   deleted: (on b13 b49) (clear b13) (arm-empty)
   added: (holding b13) (clear b49)
   goals met: 4 of 11
46. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 4 of 11
47. (unstack b49 b17)
   deleted: (on b49 b17) (clear b49) (arm-empty)
   added: (holding b49) (clear b17)
   goals met: 4 of 11
48. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 4 of 11
49. (unstack b17 b91)
   deleted: (on b17 b91) (clear b17) (arm-empty)
   added: (holding b17) (clear b91)
   goals met: 4 of 11
50. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 4 of 11
51. (unstack b91 b25)
   deleted: (on b91 b25) (clear b91) (arm-empty)
   added: (holding b91) (clear b25)
   goals met: 4 of 11
52. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 4 of 11
53. (unstack b25 b89)
   deleted: (on b25 b89) (clear b25) (arm-empty)
   added: (holding b25) (clear b89)
   goals met: 4 of 11
54. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 11
55. (unstack b89 b77)
   deleted: (on b89 b77) (clear b89) (arm-empty)
   added: (holding b89) (clear b77)
   goals met: 4 of 11
56. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 4 of 11
57. (unstack b77 b5)
   deleted: (on b77 b5) (clear b77) (arm-empty)
   added: (holding b77) (clear b5)
   goals met: 4 of 11
58. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 4 of 11
59. (unstack b5 b45)
   deleted: (on b5 b45) (clear b5) (arm-empty)
   added: (holding b5) (clear b45)
   goals met: 4 of 11
60. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 11
61. (unstack b6 b7)
   deleted: (on b6 b7) (clear b6) (arm-empty)
   added: (holding b6) (clear b7)
   goals met: 4 of 11
62. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 4 of 11
63. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 3 of 11
64. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 3 of 11
65. (unstack b2 b94)
   deleted: (on b2 b94) (clear b2) (arm-empty)
   added: (holding b2) (clear b94)
   goals met: 3 of 11
66. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 4 of 11
67. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 11
68. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 5 of 11
69. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 5 of 11
70. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 6 of 11
71. (unstack b94 b82)
   deleted: (on b94 b82) (clear b94) (arm-empty)
   added: (holding b94) (clear b82)
   goals met: 6 of 11
72. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 6 of 11
73. (unstack b82 b57)
   deleted: (on b82 b57) (clear b82) (arm-empty)
   added: (holding b82) (clear b57)
   goals met: 6 of 11
74. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 6 of 11
75. (unstack b57 b55)
   deleted: (on b57 b55) (clear b57) (arm-empty)
   added: (holding b57) (clear b55)
   goals met: 6 of 11
76. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 6 of 11
77. (unstack b55 b52)
   deleted: (on b55 b52) (clear b55) (arm-empty)
   added: (holding b55) (clear b52)
   goals met: 6 of 11
78. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 6 of 11
79. (unstack b52 b68)
   deleted: (on b52 b68) (clear b52) (arm-empty)
   added: (holding b52) (clear b68)
   goals met: 6 of 11
80. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 6 of 11
81. (unstack b68 b83)
   deleted: (on b68 b83) (clear b68) (arm-empty)
   added: (holding b68) (clear b83)
   goals met: 6 of 11
82. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 6 of 11
83. (unstack b83 b10)
   deleted: (on b83 b10) (clear b83) (arm-empty)
   added: (holding b83) (clear b10)
   goals met: 6 of 11
84. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 6 of 11
85. (unstack b10 b8)
   deleted: (on b10 b8) (clear b10) (arm-empty)
   added: (holding b10) (clear b8)
   goals met: 6 of 11
86. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 6 of 11
87. (unstack b8 b41)
   deleted: (on b8 b41) (clear b8) (arm-empty)
   added: (holding b8) (clear b41)
   goals met: 6 of 11
88. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 7 of 11
89. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 6 of 11
90. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 8 of 11
91. (unstack b41 b3)
   deleted: (on b41 b3) (clear b41) (arm-empty)
   added: (holding b41) (clear b3)
   goals met: 9 of 11
92. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 9 of 11
93. (unstack b3 b34)
   deleted: (on b3 b34) (clear b3) (arm-empty)
   added: (holding b3) (clear b34)
   goals met: 8 of 11
94. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 10 of 11
95. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 8 of 11
96. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 9 of 11
97. (unstack b8 b1)
   deleted: (on b8 b1) (clear b8) (arm-empty)
   added: (holding b8) (clear b1)
   goals met: 8 of 11
98. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 8 of 11
99. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 7 of 11
100. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 9 of 11
101. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 8 of 11
102. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 8 of 11
103. (unstack b4 b33)
   deleted: (on b4 b33) (clear b4) (arm-empty)
   added: (holding b4) (clear b33)
   goals met: 8 of 11
104. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 9 of 11
105. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 9 of 11
106. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 10 of 11
107. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 8 of 11
108. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 9 of 11
109. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 9 of 11
110. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 10 of 11
111. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 9 of 11
112. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 11 of 11
